# 1. Գրել ծրագիր, որը․
#    - կտպի մուտքագրված բառի ձայնավոր տառերը (օգտագործել set)։

word = input('word=')
vowel = {'a', 'e', 'i', 'o', 'u'}
for i in word:
    for j in vowel:
        if i == j:
            print(i)

# 2. Գրել ծրագիր, որը․
#    - կտպի երկու բազմությունների հատումը,
#    - կտպի երկու բազմությունների միավորումը,
#    - կտպի երկու բազմությունների տարբերությունը,
#    - կտպի երկու բազմությունների սիմետրիկ տարբերությունը։
#    Set 1 : {5, 6, 7, 8, 9, 10, 11, 12, 13, 14}
#    Set 2 : {20, 14, ('Python', 'C', 12), 10, 11}

Set_1 = {5, 6, 7, 8, 9, 10, 11, 12, 13, 14}
Set_2 = {20, 14, ('Python', 'C', 12), 10, 11}
print(Set_1 | Set_2, Set_1 & Set_2, Set_1 - Set_2, Set_2 - Set_1, Set_1 ^ Set_2, sep='\n')

# 3. Գրել ծրագիր, որը․
#    - կստուգի արդյոք set_1-ը set_2-ի ենթաբազմությունն է,
#    - կավելացնի այն էլեմենտները set_1-ի մեջ, որոնց շնորհիվ set_2-ը կդառնա set_1-ի ենթաբազմություն։

set_1 = {10, 20, 30, 40, 50, 60}
set_2 = {10, 20, 30, 70, 80, 90}
a = []
if set_2.issubset(set_1):
    print(set_1, set_2, sep='\n')
else:
    for i in set_2:
        if i not in set_1:
            a.append(i)
            set_1.update(a)
    print(set_1, set_2, sep='\n')
