# 1․ Գրել lambda ֆունկցիա, որը․
#    - կստանա երկու արգումենտ և կվերադարձնի այդ արգումենտների արտադրյալը։

f = lambda a, b: a * b
print(f(4, 5))

# 2. Գրել ծրագիր, որը․
#    - կբազմապատկի տրված list-ի բոլոր էլեմենտները տրված թվով lambda ֆունկցիայի միջոցով,
#    օրինակ՝ nums = [1, 2, -4, 8, -9], n = 3,
#    - կտպի ստացված լիստը,
#    տվյալ օրինակում պետք է տպի՝ [3, 6, -12, 24, -27]։

nums_1 = [1, 2, -4, 8, -9]
n = 3
nums_2 = list(map(lambda x: x * n, nums_1))
print(nums_2)

# 3․ Գրել ծրագիր, որը․
#    - կունենա հետևյալ tuple-ների list-ը, որտեղ tuple-ի առաջին էլեմենտը առարկայի անունն է, երկրորդը՝ գնահատականը,
#    օրինակ՝ user_list = [('Python', 97), ('English', 88), ('Maths', 94), ('Russian', 89)],
#    - կսորտավորի list-ի էլեմենտները ըստ գնահատականի մեծից փոքր՝ sort ֆունկցիային փոխանցելով lambda ֆունկցիա,
#    պետք է տպի՝ [('English', 88), ('Russian', 89), ('Maths', 94), ('Python', 97)]:

user_list = [('Python', 97), ('English', 88), ('Maths', 94), ('Russian', 89)]
user_list.sort(key=lambda i: i[1])
print(user_list)
