# 1․ Գրել ծրագիր որը․
#    - կունենա list, օրինակ list_1 = [1, 3, 66, 4, 6, 7, 8, 9, 33, 54, 77, 79],
#    - կտպի list_1 ի ամենամեծ զույգ թիվը (տվյալ օրինակում՝ 66)։

list_1 = [1, 3, 66, 4, 6, 7, 8, 9, 33, 54, 77, 79]
list_2 = []
for i in list_1:
    if i % 2 == 0:
        list_2.append(i)
m = max(list_2)
print(m)

# 2. Գրել, ծրագիր որը․
#    - կունենա սահմանված list որի մեջ կլինեն միայն int արժեքներ,
#      օրինակ` num_list = [13, 65, 77, 52, 10, 11, 98, 8, 6, 42, 52],
#    - կտպի մի տողում զույգ թվերը, հաջորդ տողում կենտ թվերը,
#      օրինակ` Even Numbers: 52, 10, 98, 8, 6, 42, 52,
#              Odd Numbers: 13, 65, 77, 11:

num_list = [13, 65, 77, 52, 10, 11, 98, 8, 6, 42, 52]
even_list = []
odd_list = []
for i in num_list:
    if i % 2 == 0:
        even_list.append(i)
    else:
        odd_list.append(i)
print('Even Numbers:', even_list)
print('Odd Numbers:', odd_list)

# 3. Գրել ծրագիր որը․
#    - կունենա սահմանված list որի մեջ կլինեն միայն int արժեքներ,
#      օրինակ` num_list = [43, 900, 567, 88, 988, 0, 52, 988, 27, 29],
#    - կտպի num_list ի “երկրորդ ամենամեծ” արժեքը,
#      օրինակ` տվյալ դեպքում պետք է տպի 900 , քանի որ ամենամեծ թիվը 988 ն է,
#              իսկ երկրորդ ամենամեծ արժեքը 900:

num_list1 = [43, 900, 567, 88, 988, 0, 52, 988, 27, 29]
num_list2 = []
m1 = max(num_list1)
for i in num_list1:
    if i != m1:
        num_list2.append(i)
m2 = max(num_list2)
print(m2)

# 4․ Գրել ծրագիր որը․
#    - կկարդա num ամբողջ թիվ փոփոխականը input-ի միջոցով,
#    - մեկ տողով կստեղծի list որը կպարունակի զրոյից մինչև num հատվածում
#      երեքի բաժանվող թվերի խորանարդը,
#    - կտպի ստեղծված list-ը։

num = int(input('num='))
list1 = []
for i in range(num + 1):
    if i % 3 == 0:
        list1.append(i)
print(list1)

# 5. Գրել ծրագիր, որը․
#    - իր մեջ կունենա սահմանված երկու tuple,
#      օրինակ` tuple_1 = (11, 55, 54, “abc”, 90, 102, “asdasd”, “qwerty”),
#              tuple_2 = (“bbb”, 44, 14, 11, 99, “a”),
#    - կտպի True, եթե գոյություն ունի առնվազն մեկ արժեք, որը առկա է
#      և tuple_1-ի, և tuple_2-ի մեջ, հակառակ դեպքում տպի False,
#      օրինակ՝ տվյալ դեպքում երկու tuple-ների մեջ կա 11 թիվը, այդ պատճառով պետք է տպի True:

tuple_1 = (11, 55, 54, 'abc', 90, 102, 'asdasd', 'qwerty')
tuple_2 = ('bbb', 44, 14, 11, 99, 'a')
list3 = []
for i in tuple_1:
    for j in tuple_2:
        if i == j:
            list3.append(i)
if len(list3) != 0:
    print(True)
else:
    print(False)

# 6. Գրել ծրագիր, որը․
#    - կունենա tuple, օրինակ tuple1 = (4, 5, 5, 2, 3, 2, 3, 4, 5, 5, 3),
#    - կգտնի, թե որ թվից է ամենից շատ հանդիպում tuple_1 ի մեջ
#      և կտպի այդ թիվն ու քանակը, թե քանի անգամ է հանդիպում,
#    - հաշվի առնել որ ամենաշատ հանդիպով սիմվոլներ կարող են մի քանի հատ լինել,
#    տվյալ օրինակի դեպքում պետք է տպի
#    Number is 5, count is 4
#    Քանի որ թվերը հանդիպում են հետևյալ
#    հաճախականությամբ
#    4 - 2
#    5 - 4
#    2 - 2
#    3 - 3

tuple1 = (4, 5, 5, 2, 3, 2, 3, 4, 5, 5, 3)
c = 0
list2 = []
n = tuple1[0]
for i in tuple1:
    if i not in list2:
        list2.append(i)
        a = tuple_1.count(i)
        print(i, '-', a)
        if a > c:
            c = a
            n = i
print('Number is', n, ',', 'count is', c)
